Core/src/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ТекущиеКадровыеДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеКадровыеДанныеСотрудников</name>
  <resources>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ТекущаяТарифнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютаТарифнойСтавки</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/InformationRegisters/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Сотрудники</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаОкончанияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ЗанимаемыхСтавок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботы</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияНДФЛ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>УчастникПенсионногоФонда</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </resources>
  <resources>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </resources>
  <resources>
    <name>УчаствуетДобровольно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/src/Documents/ПриемНаРаботу/ПриемНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриемНаРаботу</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияИУдержания</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗанимаемыхСтавок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГрафикРаботы</name>
      <type>
        <types>CatalogRef.ГрафикиРаботы</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчастникПенсионногоФонда</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияПФ</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>УчаствуетДобровольно</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>AzRyDivision</name>
      <type>
        <types>CatalogRef.AzRyDivision</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияДоговора</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НачисленияУдержания</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НалогиНаДоходы</name>
    <attributes>
      <name>ВидНачисленияУдержания</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Documents/Увольнение/Увольнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Увольнение</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияИУдержания</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьРуководителя</name>
    <type>
      <types>CatalogRef.Подписи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОснованиеУвольнения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтозватьПравоПодписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗанятости</name>
    <type>
      <types>EnumRef.ТипыЗанятости</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналом</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетниками</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходу</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПерсоналомРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовСПодотчетникамиРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетРасчетовПоПерерасходуРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыдачиНДФЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчетПоУмолчанию</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияПолучателейДоходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеНаИностранскомЯзыке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленияУдержания</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyUserAccountId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PersonId</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AzRyJiraUserIDs</name>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>70</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура ОбновитьТекущиеКадровыеДанныеСотрудников(СписокСотрудников = Неопределено,Документ = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ПриемНаРаботу.Организация КАК Организация,
	|	ПриемНаРаботу.Период КАК ДатаПриема,
	|	ПриемНаРаботу.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора
	|ПОМЕСТИТЬ ВТДатаПриема
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники.СрезПоследних(
	|				,
	|				&Условие
	|					И Регистратор ССЫЛКА Документ.ПриемНаРаботу) КАК ПриемНаРаботу
	|		ПО (ПриемНаРаботу.Сотрудник = Сотрудники.Ссылка)
	|			И (&Условие)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Организация КАК Организация,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.Период КАК ДатаУвольнения
	|ПОМЕСТИТЬ ВТДатыУвольнения
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			,
	|			&Условие
	|				И Регистратор ССЫЛКА Документ.Увольнение) КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Организация КАК Организация,
	|	Сотрудники.Сотрудник КАК Сотрудник,
	|	Сотрудники.Период КАК Период,
	|	Сотрудники.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора
	|ПОМЕСТИТЬ ВТКадровыеПеремещенияСрез
	|ИЗ
	|	РегистрСведений.Сотрудники.СрезПоследних(
	|			,
	|			&Условие
	|				И Должность <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)) КАК Сотрудники
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадровыеПеремещенияСрез.Организация КАК Организация,
	|	КадровыеПеремещенияСрез.Сотрудник КАК Сотрудник,
	|	Сотрудники.Должность КАК Должность,
	|	Сотрудники.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	КадровыеПеремещенияСрез.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора
	|ПОМЕСТИТЬ ВТКадровыеПеремещения
	|ИЗ
	|	ВТКадровыеПеремещенияСрез КАК КадровыеПеремещенияСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Сотрудники КАК Сотрудники
	|		ПО (Сотрудники.Период = КадровыеПеремещенияСрез.Период)
	|			И (Сотрудники.Организация = КадровыеПеремещенияСрез.Организация)
	|			И (Сотрудники.Сотрудник = КадровыеПеремещенияСрез.Сотрудник)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеНачисленияИУдержания.Организация КАК Организация,
	|	ПлановыеНачисленияИУдержания.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(ПлановыеНачисленияИУдержания.Период) КАК Период
	|ПОМЕСТИТЬ ВТПлановыеНачисленияИУдержанияСрез
	|ИЗ
	|	РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|ГДЕ
	|	&Условие
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеНачисленияИУдержания.Организация,
	|	ПлановыеНачисленияИУдержания.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПлановыеНачисленияИУдержанияСрез.Организация КАК Организация,
	|	ПлановыеНачисленияИУдержанияСрез.Сотрудник КАК Сотрудник,
	|	ПлановыеНачисленияИУдержания.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ПлановыеНачисленияИУдержания.Валюта = НациональнаяВалюта.Значение
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет,
	|	СУММА(ВЫБОР
	|			КОГДА ПлановыеНачисленияИУдержания.ВидНачисленияУдержания.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыНачисленийИУдержаний.Начисление)
	|				ТОГДА ПлановыеНачисленияИУдержания.Сумма
	|			ИНАЧЕ -ПлановыеНачисленияИУдержания.Сумма
	|		КОНЕЦ) КАК Сумма
	|ПОМЕСТИТЬ ВТНачисленияИУдержания
	|ИЗ
	|	ВТПлановыеНачисленияИУдержанияСрез КАК ПлановыеНачисленияИУдержанияСрез
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПлановыеНачисленияИУдержания КАК ПлановыеНачисленияИУдержания
	|		ПО ПлановыеНачисленияИУдержанияСрез.Период = ПлановыеНачисленияИУдержания.Период
	|			И ПлановыеНачисленияИУдержанияСрез.Организация = ПлановыеНачисленияИУдержания.Организация
	|			И ПлановыеНачисленияИУдержанияСрез.Сотрудник = ПлановыеНачисленияИУдержания.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ Константа.НациональнаяВалюта КАК НациональнаяВалюта
	|		ПО (ИСТИНА)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПлановыеНачисленияИУдержанияСрез.Организация,
	|	ПлановыеНачисленияИУдержанияСрез.Сотрудник,
	|	ПлановыеНачисленияИУдержания.Валюта,
	|	НациональнаяВалюта.Значение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПринятыеСотрудники.Организация КАК Организация,
	|	ПринятыеСотрудники.Сотрудник КАК Сотрудник,
	|	ПринятыеСотрудники.ДатаПриема КАК ДатаПриема,
	|	ВЫБОР
	|		КОГДА ВТДатыУвольнения.ДатаУвольнения < ПринятыеСотрудники.ДатаПриема
	|			ТОГДА &ПустаяДата
	|		ИНАЧЕ ВТДатыУвольнения.ДатаУвольнения
	|	КОНЕЦ КАК ДатаУвольнения,
	|	ВТКадровыеПеремещения.Должность КАК ТекущаяДолжность,
	|	ВТКадровыеПеремещения.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НачисленияИУдержанияНацВалюта.Сумма, 0) > 0
	|			ТОГДА НачисленияИУдержанияНацВалюта.Валюта
	|		ИНАЧЕ НачисленияИУдержания.Валюта
	|	КОНЕЦ КАК ВалютаТарифнойСтавки,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(НачисленияИУдержанияНацВалюта.Сумма, 0) > 0
	|			ТОГДА ЕСТЬNULL(НачисленияИУдержанияНацВалюта.Сумма, 0)
	|		ИНАЧЕ ЕСТЬNULL(НачисленияИУдержания.Сумма, 0)
	|	КОНЕЦ КАК ТекущаяТарифнаяСтавка,
	|	ВЫБОР
	|		КОГДА &Документ = ""КадровоеПеремещение""
	|			ТОГДА ВТКадровыеПеремещения.ДатаОкончанияДоговора
	|		ИНАЧЕ ПринятыеСотрудники.ДатаОкончанияДоговора
	|	КОНЕЦ КАК ДатаОкончанияДоговора
	|ИЗ
	|	ВТДатаПриема КАК ПринятыеСотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДатыУвольнения КАК ВТДатыУвольнения
	|		ПО ПринятыеСотрудники.Организация = ВТДатыУвольнения.Организация
	|			И ПринятыеСотрудники.Сотрудник = ВТДатыУвольнения.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКадровыеПеремещения КАК ВТКадровыеПеремещения
	|		ПО ПринятыеСотрудники.Организация = ВТКадровыеПеремещения.Организация
	|			И ПринятыеСотрудники.Сотрудник = ВТКадровыеПеремещения.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияИУдержания КАК НачисленияИУдержанияНацВалюта
	|		ПО ПринятыеСотрудники.Организация = НачисленияИУдержанияНацВалюта.Организация
	|			И ПринятыеСотрудники.Сотрудник = НачисленияИУдержанияНацВалюта.Сотрудник
	|			И (НачисленияИУдержанияНацВалюта.Приоритет = 1)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТНачисленияИУдержания КАК НачисленияИУдержания
	|		ПО ПринятыеСотрудники.Организация = НачисленияИУдержания.Организация
	|			И ПринятыеСотрудники.Сотрудник = НачисленияИУдержания.Сотрудник
	|			И (НачисленияИУдержания.Приоритет = 2)";
	Если СписокСотрудников = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "Истина");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "Сотрудник В (&СписокСотрудников)");
		Запрос.УстановитьПараметр("СписокСотрудников", СписокСотрудников);
	КонецЕсли;
	Запрос.УстановитьПараметр("ПустаяДата",'00010101');
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = РегистрыСведений.ТекущиеКадровыеДанныеСотрудников.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
